In [2]:
## dropna 
import numpy as np
import pandas as pd
data = pd.read_csv("titanic.csv")

In [9]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
data.shape

(418, 12)

In [5]:
data.dropna().shape

(87, 12)

In [6]:
data.dropna(how = 'all').shape

(418, 12)

In [7]:
data.dropna(axis=1).shape

(418, 9)

In [8]:
data.dropna(axis=1, how = 'all').shape

(418, 12)

In [11]:
data.dropna(subset = ['Cabin']).shape

(91, 12)

In [12]:
data.dropna(subset = ['Embarked']).shape

(418, 12)

In [13]:
data.dropna(subset = ['Cabin', 'Embarked']).shape

(91, 12)

In [ ]:
## fillna

In [16]:
data.fillna(0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,0,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,0,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,0,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,0,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,0.0,0,0,A.5. 3236,8.0500,0,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,0,S
416,1308,0,3,"Ware, Mr. Frederick",male,0.0,0,0,359309,8.0500,0,S
417,1309,0,3,"Peter, Master. Michael J",male,0.0,1,1,2668,22.3583,0,C

In [17]:
data.fillna(0).shape

(418, 12)

In [19]:
data['Cabin'].fillna("Not Specified")

0      Not Specified
1      Not Specified
2      Not Specified
3      Not Specified
4      Not Specified
           ...
413    Not Specified
414             C105
415    Not Specified
416    Not Specified
417    Not Specified
Name: Cabin, Length: 418, dtype: object

In [20]:
data['Age'].fillna(30)

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413    30.0
414    39.0
415    38.5
416    30.0
417    30.0
Name: Age, Length: 418, dtype: float64

In [21]:
data['Age']

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64

In [22]:
data['Age'].fillna(method = 'bfill')

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413    39.0
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64

In [23]:
data['Age'].fillna(method = 'ffill')

0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413    28.0
414    39.0
415    38.5
416    38.5
417    38.5
Name: Age, Length: 418, dtype: float64